Pandas
==========
Pandas is a powerful tool to manipulate dataframes in Python.  There are many features and examples are listed below.

Addiitional releated packages:
* NumPy: the fundamental package for scientific computing
* matplotlib: the most popular Python library for producing plots and other 2D data visualizations
* pandas: a library providing high-performance, easy-to-use data structures and data analysis tools
* SciPy: a collection of packages addressing a number of different standard problem domains in scientific computing
* sklearn: machine learning in Python

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('~/Desktop/PythonLearning/City_of_Burlington_Property_Details.csv')

replacing vaues with NaN, Suppose the letter included is 'g':

cchs = pd.read_csv("cchs2012.csv", header=0, na_values=['g'])
 
If the data contains missing data indicated by 'NA', you can read the data in as follows:

cchs = pd.read_csv("cchs2012.csv", header=0, na_values=['NA'])

In [3]:
# Checks correlation of the dataframe, specify a column in the parenthesis to check against a specific variable
df.corr()

# Display the top 5 rows (including the column names)
df.head(5)

# Lists summary info of datafram including count of non-null elements, data type, memory useage and range index
df.info()

# Count of number of rows and columns (in that order) ex: (24,12)
#df.shape()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10832 entries, 0 to 10831
Data columns (total 38 columns):
AccountNumber            10832 non-null int64
ParcelID                 10832 non-null object
SpanNumber               10832 non-null object
StreetNumber             10827 non-null object
AlternateNumber          1074 non-null object
StreetName               10832 non-null object
Unit                     2076 non-null object
CuO1LastName             10831 non-null object
CuO1FirstName            8519 non-null object
CuO2LastName             5633 non-null object
CuO2FirstName            5107 non-null object
CuO3LastName             572 non-null object
CuO3FirstName            461 non-null object
LandUse                  10832 non-null object
CurrentAcres             10832 non-null float64
TotalGrossArea           10832 non-null int64
FinishedArea             10832 non-null float64
CurrentValue             10832 non-null float64
CurrentLandValue         10832 non-null int64
CurrentYardItemsValue    10832 non-null int64
CurrentBuildingValue     10832 non-null float64
BuildingType             10431 non-null object
HeatFuel                 10339 non-null object
HeatType                 10409 non-null object
Grade                    10431 non-null object
YearBlt                  10832 non-null int64
SaleDate                 4636 non-null object
SalePrice                10832 non-null int64
LegalReference           10832 non-null object
GrantorLastName          4635 non-null object
NumofRooms               10832 non-null int64
NumofBedrooms            10832 non-null int64
Baths                    10832 non-null object
NumofUnits               10832 non-null int64
ZoningCode               10777 non-null object
Foundation               10382 non-null object
Depreciation             10832 non-null float64
PropertyCenterPoint      10615 non-null object
dtypes: float64(5), int64(9), object(24)
memory usage: 3.1+ MB

In [4]:
#Just pull a specific column
df['LandUse'].head(4)

0      Exempt Land
1    Single Family
2      Exempt Land
3           Exempt
Name: LandUse, dtype: object

In [5]:
df['LandUse'].value_counts()

Single Family                   5176
Residential Condo               2150
2 Family                        1041
3 Family                         369
Apartments 5+Units               367
Commercial                       299
Exempt                           286
4 Family                         239
Res. Vacant Land                 235
Commercial and Residential       158
Mobile Home                      117
Exempt Land                      112
Commercial Condo                  91
Seasonal home                     45
Partial Exempt                    43
Commercial Land                   34
Industrial                        22
Exempt Utility                    11
Mobile Home w/Land                 8
Farmland                           6
Utility Electric                   6
RESIDENTAL APT CONDO               6
Utility Other                      4
Industrial Land                    3
Farm                               2
Commercial/Residential Condo       1
Cable TV personal property         1
Name: LandUse, dtype: int64

In [6]:
# List unique values in a DataFrame column
pd.unique(df.NumofUnits.ravel())

array([  0,   1,   2,   4,  13,   3,   6,   5,  19,  44,  37, 123,   7,
        49,   9,  61,  11,  10,   8, 109,  21,  16, 401,  26,  51,  33,
        27,  12,  17,  41,  47, 125,  23,  54,  25, 375,  39, 605,  80,
       112,  42,  52,  24,  55, 462,  14, 140,  15, 161,  20,  18,  76,
       258,  22,  34,  36,  31,  82,  28, 396,  81, 581, 205, 460, 303,
        29, 227, 128,  84, 144, 311, 216,  66, 160,  59,  56,  65, 225,
       117, 338, 220,  43,  35,  40, 908,  30, 679, 150], dtype=int64)

In [7]:
# Get quick count of rows in a DataFrame
len(df.index)

10832

In [8]:
df.isnull().sum()

AccountNumber                0
ParcelID                     0
SpanNumber                   0
StreetNumber                 5
AlternateNumber           9758
StreetName                   0
Unit                      8756
CuO1LastName                 1
CuO1FirstName             2313
CuO2LastName              5199
CuO2FirstName             5725
CuO3LastName             10260
CuO3FirstName            10371
LandUse                      0
CurrentAcres                 0
TotalGrossArea               0
FinishedArea                 0
CurrentValue                 0
CurrentLandValue             0
CurrentYardItemsValue        0
CurrentBuildingValue         0
BuildingType               401
HeatFuel                   493
HeatType                   423
Grade                      401
YearBlt                      0
SaleDate                  6196
SalePrice                    0
LegalReference               0
GrantorLastName           6197
NumofRooms                   0
NumofBedrooms                0
Baths                        0
NumofUnits                   0
ZoningCode                  55
Foundation                 450
Depreciation                 0
PropertyCenterPoint        217
dtype: int64

Numpy
-----------
Quick Mathmatical Functions

In [9]:
# Mathmatical description and statistics of all numerical columns
df.describe()

# Returns a count of not null elements in each column (much like df.info)
df.count()

# Returns a list of numerical columns with total sum
df.sum()

# Returns a list of numerical columns with standard deviation
df.std()

# Returns a list of numerical columns with mean
df.mean()

# Returns a list of numerical columns with median
df.median()

AccountNumber              5538.50000
CurrentAcres                  0.15152
TotalGrossArea             3174.00000
FinishedArea               1602.00000
CurrentValue             236150.00000
CurrentLandValue          91600.00000
CurrentYardItemsValue         0.00000
CurrentBuildingValue     147600.00000
YearBlt                    1950.00000
SalePrice                     0.00000
NumofRooms                    6.00000
NumofBedrooms                 3.00000
NumofUnits                    1.00000
Depreciation                  0.24000
dtype: float64

In [10]:
# Get length of data in a DataFrame column
dflen = df.StreetNumber.str.len()
dflen.head()

0    3.0
1    2.0
2    2.0
3    3.0
4    2.0
Name: StreetNumber, dtype: float64

Creating Group By Lists
------------

In [11]:
df[["HeatType", "NumofRooms"]].groupby(['HeatType'], as_index=False).count().sort_values(by='NumofRooms',ascending=0)
#df[["HeatType", "NumofRooms"]].groupby(['HeatType'], as_index=False).mean()
#df[["HeatType", "NumofRooms"]].groupby(['HeatType'], as_index=False).median()

        HeatType  NumofRooms
4      HOT WATER        4482
3        HOT AIR        4240
7     SPACE HEAT         823
0       ELECTRIC         307
8          STEAM         249
5           HVAC          80
2      HEAT PUMP          69
6    RADIANT FLR          60
1   H WATER/RADI          52
10      UNHEATED          41
9        TYPICAL           6

Numpy Percentiles
------------

In [12]:
# Returns percentile value for specificed column
np.percentile(df['TotalGrossArea'],25)

# Returns an array of specified percentiles for specificed column, it is in scientific notation because it is float
np.percentile(df['TotalGrossArea'],[0,25,50,100])

array([  0.00000000e+00,   2.31700000e+03,   3.17400000e+03,
         2.54235100e+06])

In [13]:
# When doing it with an interger it will not have scientific notation
np.percentile(df['YearBlt'],[0,25,50,100])

array([    0.,  1905.,  1950.,  2015.])

Change Number Format to Non-Scientific
---------

In [14]:
# Set up formatting so larger numbers aren't displayed in scientific notation (h/t @thecapacity)
pd.set_option('display.float_format', lambda x: '%.3f' % x)
df.describe()

,AccountNumber,CurrentAcres,TotalGrossArea,FinishedArea,CurrentValue,CurrentLandValue,CurrentYardItemsValue,CurrentBuildingValue,YearBlt,SalePrice,NumofRooms,NumofBedrooms,NumofUnits,Depreciation
count,10832.000,10832.000,10832.000,10832.000,10832.000,10832.000,10832.000,10832.000,10832.000,10832.000,10832.000,10832.000,10832.000,10832.000
mean,5553.359,0.516,5969.555,3585.568,475544.887,141301.388,3964.462,330279.037,1873.584,139643.888,7.489,3.584,2.672,0.217
std,3229.509,5.011,30269.310,22154.404,4025693.608,448098.939,51269.295,3753893.696,369.142,422177.225,13.168,8.768,18.860,0.126
min,1.000,0.000,0.000,0.000,0.000,0.000,0.000,-8800.000,0.000,0.000,0.000,0.000,0.000,-0.030
25%,2741.750,0.052,2317.000,1152.000,190000.000,38213.500,0.000,113300.000,1905.000,0.000,5.000,2.000,1.000,0.120
50%,5538.500,0.152,3174.000,1602.000,236150.000,91600.000,0.000,147600.000,1950.000,0.000,6.000,3.000,1.000,0.240
75%,8368.250,0.241,4436.250,2314.625,339400.000,141900.000,400.000,212800.000,1974.000,230000.000,8.000,4.000,1.000,0.300
max,11227.000,277.480,2542351.000,1894189.625,391003000.000,21055700.000,2834100.000,367113200.000,2015.000,30225000.000,605.000,605.000,908.000,1.000

Binning
------

In [15]:
# You can bin at whatever cut you want, in this case it is percentiles
yearperc = np.percentile(df['YearBlt'],[0,25,50,100])

# This creates a new column, but you can also overwrite the data already there
df['YearBltBin'] = pd.cut(df['YearBlt'], yearperc)
df.head(3)

,AccountNumber,ParcelID,SpanNumber,StreetNumber,AlternateNumber,StreetName,Unit,CuO1LastName,CuO1FirstName,CuO2LastName,...,GrantorLastName,NumofRooms,NumofBedrooms,Baths,NumofUnits,ZoningCode,Foundation,Depreciation,PropertyCenterPoint,YearBltBin
0,7502,049-3-187-000,114-035-17502,227,NaN,COLLEGE ST,NaN,CITY DPW,NaN,NaN,...,NaN,0,0,0 / 0,0,DT,NaN,0.000,"(-73.2105, 44.47668)",NaN
1,10680,043-3-085-001,114-035-20680,53,NaN,WARD ST,NaN,EMERSON,DEBORAH A,EMERSON,...,NaN,6,3,1 / 0,1,NaN,C,0.300,NaN,"(1905, 1950]"
2,9512,057-1-013-000,114-035-19512,47,NaN,SEARS LN,NaN,CITY OF BURLINGTON,NaN,NaN,...,NaN,0,0,0 / 0,0,ELM,NaN,0.000,"(-73.2168, 44.45806)",NaN

Subsetting
------------
Return subsets of a dateframe

In [16]:
# Returns first row through the specified number of rows, in this case 50
subdf = df[:50]
subdf.shape

(50, 39)

In [17]:
# Returns from row 100 through too the end of the dataframe
subdf = df[100:]
subdf.shape

(10732, 39)

In [18]:
# Select from DataFrame using criteria from multiple columns
# (use `|` instead of `&` to do an OR)
newdf = df[(df['NumofRooms'] > 1) & (df['Foundation'] == 'C')]
newdf.head(3)

,AccountNumber,ParcelID,SpanNumber,StreetNumber,AlternateNumber,StreetName,Unit,CuO1LastName,CuO1FirstName,CuO2LastName,...,GrantorLastName,NumofRooms,NumofBedrooms,Baths,NumofUnits,ZoningCode,Foundation,Depreciation,PropertyCenterPoint,YearBltBin
1,10680,043-3-085-001,114-035-20680,53,NaN,WARD ST,NaN,EMERSON,DEBORAH A,EMERSON,...,NaN,6,3,1 / 0,1,NaN,C,0.300,NaN,"(1905, 1950]"
9,3317,033-1-013-000,114-035-13317,125,NaN,KILLARNEY DR,NaN,GOLDBERG,STEPHEN J,NaN,...,NaN,6,3,1 / 1,1,RL,C,0.270,"(-73.2436, 44.50101)","(1950, 2015]"
13,6131,045-2-153-002,114-035-16131,84,NaN,BUELL ST,Unit 2,GARDNER,NEIL,NaN,...,NaN,6,4,2 / 0,1,RH,C,0.150,"(-73.2081, 44.47953)","(1950, 2015]"

In [19]:
# pixdf = df.ix[:,'StreetNumber':'StreetName']
ixdf = df.ix[:,'StreetNumber':'StreetName']
ixdf.head(5)

  StreetNumber AlternateNumber        StreetName
0          227             NaN        COLLEGE ST
1           53             NaN           WARD ST
2           47             NaN          SEARS LN
3          258             NaN  SOUTH WILLARD ST
4           47             NaN        CENTRAL AV

In [20]:
# Grab DataFrame rows where column has certain values
valuelist = ['4']
dfselect = df[df.NumofUnits.isin(valuelist)]
dfselect.head(2)

Empty DataFrame
Columns: [AccountNumber, ParcelID, SpanNumber, StreetNumber, AlternateNumber, StreetName, Unit, CuO1LastName, CuO1FirstName, CuO2LastName, CuO2FirstName, CuO3LastName, CuO3FirstName, LandUse, CurrentAcres, TotalGrossArea, FinishedArea, CurrentValue, CurrentLandValue, CurrentYardItemsValue, CurrentBuildingValue, BuildingType, HeatFuel, HeatType, Grade, YearBlt, SaleDate, SalePrice, LegalReference, GrantorLastName, NumofRooms, NumofBedrooms, Baths, NumofUnits, ZoningCode, Foundation, Depreciation, PropertyCenterPoint, YearBltBin]
Index: []

[0 rows x 39 columns]

In [21]:
# Grab DataFrame rows where column doesn't have certain values
valuelist = ['4', '13', '6']
dfnotselect = df[~df.NumofUnits.isin(valuelist)]
dfnotselect.head(2)

,AccountNumber,ParcelID,SpanNumber,StreetNumber,AlternateNumber,StreetName,Unit,CuO1LastName,CuO1FirstName,CuO2LastName,...,GrantorLastName,NumofRooms,NumofBedrooms,Baths,NumofUnits,ZoningCode,Foundation,Depreciation,PropertyCenterPoint,YearBltBin
0,7502,049-3-187-000,114-035-17502,227,NaN,COLLEGE ST,NaN,CITY DPW,NaN,NaN,...,NaN,0,0,0 / 0,0,DT,NaN,0.000,"(-73.2105, 44.47668)",NaN
1,10680,043-3-085-001,114-035-20680,53,NaN,WARD ST,NaN,EMERSON,DEBORAH A,EMERSON,...,NaN,6,3,1 / 0,1,NaN,C,0.300,NaN,"(1905, 1950]"

Subsetting Not Null/Null
-------------

In [22]:
# Grab DataFrame rows where specific column is null
nulldf = df[df['AlternateNumber'].isnull()]
nulldf.head(3)

#Alternative way to write it
nulldf = df[pd.isnull(df['AlternateNumber'])]
nulldf.head(3)

,AccountNumber,ParcelID,SpanNumber,StreetNumber,AlternateNumber,StreetName,Unit,CuO1LastName,CuO1FirstName,CuO2LastName,...,GrantorLastName,NumofRooms,NumofBedrooms,Baths,NumofUnits,ZoningCode,Foundation,Depreciation,PropertyCenterPoint,YearBltBin
0,7502,049-3-187-000,114-035-17502,227,NaN,COLLEGE ST,NaN,CITY DPW,NaN,NaN,...,NaN,0,0,0 / 0,0,DT,NaN,0.000,"(-73.2105, 44.47668)",NaN
1,10680,043-3-085-001,114-035-20680,53,NaN,WARD ST,NaN,EMERSON,DEBORAH A,EMERSON,...,NaN,6,3,1 / 0,1,NaN,C,0.300,NaN,"(1905, 1950]"
2,9512,057-1-013-000,114-035-19512,47,NaN,SEARS LN,NaN,CITY OF BURLINGTON,NaN,NaN,...,NaN,0,0,0 / 0,0,ELM,NaN,0.000,"(-73.2168, 44.45806)",NaN

In [23]:
# Grab DataFrame rows where specific column notnull
notnulldf = df[df['AlternateNumber'].notnull()]
notnulldf.head(3)

,AccountNumber,ParcelID,SpanNumber,StreetNumber,AlternateNumber,StreetName,Unit,CuO1LastName,CuO1FirstName,CuO2LastName,...,GrantorLastName,NumofRooms,NumofBedrooms,Baths,NumofUnits,ZoningCode,Foundation,Depreciation,PropertyCenterPoint,YearBltBin
21,10714,054-3-001-143,114-035-20714,384,392,SOUTH PROSPECT ST,NaN,UNIVERSITY OF VERMONT,NaN,STATE AGRICULTURAL COLLEGE,...,NaN,0,0,1 / 2,2,NaN,C,0.399,NaN,"(1905, 1950]"
25,6052,045-2-075-000,114-035-16052,47,49,GREENE ST,NaN,LANG,ANN G,NaN,...,NaN,8,4,2 / 0,2,RM,BS,0.270,"(-73.2078, 44.48206)","(0, 1905]"
48,5507,044-4-185-000,114-035-15507,247,249,PEARL ST,NaN,247 PEARL LLC,NaN,NaN,...,NaN,0,0,1 / 6,3,RH,BS,0.475,"(-73.2087, 44.48001)","(0, 1905]"

Replacing Column Names
---------------

In [24]:
# Rename several DataFrame columns
df = df.rename(columns = {
    'Baths':'BathsCombined',
    'GrantorLastName':'GrantorName',
})
df.head(1)

,AccountNumber,ParcelID,SpanNumber,StreetNumber,AlternateNumber,StreetName,Unit,CuO1LastName,CuO1FirstName,CuO2LastName,...,GrantorName,NumofRooms,NumofBedrooms,BathsCombined,NumofUnits,ZoningCode,Foundation,Depreciation,PropertyCenterPoint,YearBltBin
0,7502,049-3-187-000,114-035-17502,227,NaN,COLLEGE ST,NaN,CITY DPW,NaN,NaN,...,NaN,0,0,0 / 0,0,DT,NaN,0.000,"(-73.2105, 44.47668)",NaN

In [25]:
# Even more fancy DataFrame column re-naming
# lower-case all DataFrame column names (for example)
#df.rename(columns=lambda x: x.split('.')[-1], inplace=True)
# Loop through rows in a DataFrame
# (if you must)
#for index, row in df.iterrows():
#    print index, row['some column']

Working with Date and Time Objects
------

In [ ]:
#ded = pd.to_datetime(wholedf['timeonly'],infer_datetime_format=True)

#ded = pd.to_datetime(wholedf['timeonly'],format='%I:%M:%S %p')

#from datetime import date
#day = date.month(wholedf['Date'])
#day

In [ ]:
# Splite date out into seperate date and time only and then convert orginal date to datetime type
3wholedf['dateonly'], wholedf['timeonly'] = wholedf['Date'].str.split(' ', 1).str
#wholedf['monthonly'], wholedf['dayonly'] = wholedf['dateonly'].str.split('/', 1).str
#wholedf['dayonly'], wholedf['yearonly'] = wholedf['dayonly'].str.split('/', 1).str
#wholedf['houronly'], wholedf['minuteonly'] = wholedf['timeonly'].str.split(':', 1).str
#wholedf['minuteonly'], wholedf['secondonly'] = wholedf['minuteonly'].str.split(':', 1).str
#wholedf['secondonly'], wholedf['ampmonly'] = wholedf['secondonly'].str.split(' ', 1).str

#wholedf['dateonly'] = pd.to_datetime(wholedf['dateonly'], format='%m/%d/%Y')
#temptimeonly = pd.to_datetime(wholedf['timeonly'],format='%I:%M:%S %p')
#wholedf['junkdate'], wholedf['24houronly'] = temptimeonly.str.split(' ', 1).str
#del whole['junkdate']

# best way to split out date and time into seperate columns
#wholedf['Date'] = pd.to_datetime(wholedf['Date'])
#wholedf['timeonly'],wholedf['dateonly']= wholedf['Date'].apply(lambda x:x.time()), wholedf['Date'].apply(lambda x:x.date())

Replace Values
------

In [26]:
df.isnull().sum()

AccountNumber                0
ParcelID                     0
SpanNumber                   0
StreetNumber                 5
AlternateNumber           9758
StreetName                   0
Unit                      8756
CuO1LastName                 1
CuO1FirstName             2313
CuO2LastName              5199
CuO2FirstName             5725
CuO3LastName             10260
CuO3FirstName            10371
LandUse                      0
CurrentAcres                 0
TotalGrossArea               0
FinishedArea                 0
CurrentValue                 0
CurrentLandValue             0
CurrentYardItemsValue        0
CurrentBuildingValue         0
BuildingType               401
HeatFuel                   493
HeatType                   423
Grade                      401
YearBlt                      0
SaleDate                  6196
SalePrice                    0
LegalReference               0
GrantorName               6197
NumofRooms                   0
NumofBedrooms                0
BathsCombined                0
NumofUnits                   0
ZoningCode                  55
Foundation                 450
Depreciation                 0
PropertyCenterPoint        217
YearBltBin                 401
dtype: int64

In [27]:
# Replace one value with another for the whole dataframe
dfreplace = df.replace("SOUTH WILLARD ST","S Willard Street")
dfreplace.head(5)

,AccountNumber,ParcelID,SpanNumber,StreetNumber,AlternateNumber,StreetName,Unit,CuO1LastName,CuO1FirstName,CuO2LastName,...,GrantorName,NumofRooms,NumofBedrooms,BathsCombined,NumofUnits,ZoningCode,Foundation,Depreciation,PropertyCenterPoint,YearBltBin
0,7502,049-3-187-000,114-035-17502,227,NaN,COLLEGE ST,NaN,CITY DPW,NaN,NaN,...,NaN,0,0,0 / 0,0,DT,NaN,0.000,"(-73.2105, 44.47668)",NaN
1,10680,043-3-085-001,114-035-20680,53,NaN,WARD ST,NaN,EMERSON,DEBORAH A,EMERSON,...,NaN,6,3,1 / 0,1,NaN,C,0.300,NaN,"(1905, 1950]"
2,9512,057-1-013-000,114-035-19512,47,NaN,SEARS LN,NaN,CITY OF BURLINGTON,NaN,NaN,...,NaN,0,0,0 / 0,0,ELM,NaN,0.000,"(-73.2168, 44.45806)",NaN
3,7960,050-2-019-001,114-035-17960,258,NaN,S Willard Street,NaN,CHAMPLAIN COLLEGE INC.,NaN,NaN,...,NaN,0,0,0 / 5,1,I,S,0.060,"(-73.2044, 44.47292)","(1950, 2015]"
4,9255,056-3-017-000,114-035-19255,47,NaN,CENTRAL AV,NaN,BRANDT,RICHARD,NaN,...,NaN,9,4,2 / 1,2,RLW,BS,0.236,"(-73.2213, 44.45953)","(0, 1905]"

In [28]:
#This can also be done with multiple changes in one line
dfreplace = df.replace({"COLLEGE ST":"College Street",
                        "CHERRY ST":"Cherry Street"})
dfreplace.head(3)

,AccountNumber,ParcelID,SpanNumber,StreetNumber,AlternateNumber,StreetName,Unit,CuO1LastName,CuO1FirstName,CuO2LastName,...,GrantorName,NumofRooms,NumofBedrooms,BathsCombined,NumofUnits,ZoningCode,Foundation,Depreciation,PropertyCenterPoint,YearBltBin
0,7502,049-3-187-000,114-035-17502,227,NaN,College Street,NaN,CITY DPW,NaN,NaN,...,NaN,0,0,0 / 0,0,DT,NaN,0.000,"(-73.2105, 44.47668)",NaN
1,10680,043-3-085-001,114-035-20680,53,NaN,WARD ST,NaN,EMERSON,DEBORAH A,EMERSON,...,NaN,6,3,1 / 0,1,NaN,C,0.300,NaN,"(1905, 1950]"
2,9512,057-1-013-000,114-035-19512,47,NaN,SEARS LN,NaN,CITY OF BURLINGTON,NaN,NaN,...,NaN,0,0,0 / 0,0,ELM,NaN,0.000,"(-73.2168, 44.45806)",NaN

In [29]:
#train_df.loc[train_df["Title"] == "Mlle", "Title"] = 'Miss'
#calltype.drop(['Call Type'])

In [30]:
# Set DataFrame column values based on other column values
df.loc[(df['AccountNumber'] == 5333), 'AlternateNumber'] = 1
df.head(2)

,AccountNumber,ParcelID,SpanNumber,StreetNumber,AlternateNumber,StreetName,Unit,CuO1LastName,CuO1FirstName,CuO2LastName,...,GrantorName,NumofRooms,NumofBedrooms,BathsCombined,NumofUnits,ZoningCode,Foundation,Depreciation,PropertyCenterPoint,YearBltBin
0,7502,049-3-187-000,114-035-17502,227,NaN,COLLEGE ST,NaN,CITY DPW,NaN,NaN,...,NaN,0,0,0 / 0,0,DT,NaN,0.000,"(-73.2105, 44.47668)",NaN
1,10680,043-3-085-001,114-035-20680,53,NaN,WARD ST,NaN,EMERSON,DEBORAH A,EMERSON,...,NaN,6,3,1 / 0,1,NaN,C,0.300,NaN,"(1905, 1950]"

In [31]:
# Set DataFrame column values based on other column values
df.loc[(df['AccountNumber'] == 5333) | (df['StreetNumber'] == 75), 'AlternateNumber'] = 3
df.head(2)

,AccountNumber,ParcelID,SpanNumber,StreetNumber,AlternateNumber,StreetName,Unit,CuO1LastName,CuO1FirstName,CuO2LastName,...,GrantorName,NumofRooms,NumofBedrooms,BathsCombined,NumofUnits,ZoningCode,Foundation,Depreciation,PropertyCenterPoint,YearBltBin
0,7502,049-3-187-000,114-035-17502,227,NaN,COLLEGE ST,NaN,CITY DPW,NaN,NaN,...,NaN,0,0,0 / 0,0,DT,NaN,0.000,"(-73.2105, 44.47668)",NaN
1,10680,043-3-085-001,114-035-20680,53,NaN,WARD ST,NaN,EMERSON,DEBORAH A,EMERSON,...,NaN,6,3,1 / 0,1,NaN,C,0.300,NaN,"(1905, 1950]"

In [32]:
#test_df["Fare"].fillna(test_df["Fare"].median(), inplace=True)
#train_df['Age']= train_df.Age.fillna(train_df.Age.interpolate(method='linear')) 
#train_df['Age']= train_df.Age.fillna(train_df.Age.mean())

In [33]:
# Clean up missing values in multiple DataFrame columns
df = df.fillna({'ZoningCode': 'R','Foundation': 'C',})

In [34]:
# Delete column from DataFrame
del df['LegalReference']

Converting Types of Data
--------------

In [35]:
# Converting a float to interger
df['FinishedArea'] = df['FinishedArea'].astype(int)

In [36]:
# Another way to change data type of DataFrame column
df.TotalGrossArea = df.TotalGrossArea.astype(np.int64)

In [37]:
# Convert to datetime time series, important for visualization
df['SaleDate'] = pd.to_datetime(df['SaleDate'])
# Check the date, should show as datetime64[ns]
#df.info()

In [38]:
# Convert Series datatype to numeric, getting rid of any non-numeric values
#df['ZoningCode'] = df['ZoningCode'].to_numeric(df['ZoningCode'])
#df['ZoningCode']
#df.head()

Sorting
---------------

In [39]:
# Sort dataframe by multiple columns, 0 is descending from highest and 1 is ascending from lowest
df = df.sort_values(by=['NumofRooms','NumofBedrooms','NumofUnits'],ascending=[0,1,0])
df.head(3)

,AccountNumber,ParcelID,SpanNumber,StreetNumber,AlternateNumber,StreetName,Unit,CuO1LastName,CuO1FirstName,CuO2LastName,...,GrantorName,NumofRooms,NumofBedrooms,BathsCombined,NumofUnits,ZoningCode,Foundation,Depreciation,PropertyCenterPoint,YearBltBin
1860,5333,044-4-033-000,114-035-15333,75,3,CHERRY ST,NaN,"BTC MALL ASSOCIATES, LLC",NaN,NaN,...,NaN,605,605,0 / 0,605,D,C,1.000,"(-73.215, 44.47894)","(1950, 2015]"
9583,7871,050-1-066-000,114-035-17871,225,NaN,SOUTH WILLARD ST,NaN,CHAMPLAIN COLLEGE INC.,NaN,NaN,...,NaN,400,0,11 / 0,20,I,BS,0.300,"(-73.2063, 44.47431)","(0, 1905]"
3519,7583,049-4-059-000,114-035-17583,230,NaN,ST PAUL ST,NaN,BURLINGTON HOUSING AUTHORITY,NaN,BHA DECKER TOWERS,...,NaN,371,106,161 / 1,161,RM,S,0.278,"(-73.213, 44.47275)","(1950, 2015]"

Transposition
------------

In [40]:
transposeddf = df.T
transposeddf.head(3)
# Pivot data (with flexibility about what what
# becomes a column and what stays a row)
# Syntax works on Pandas >= .14
#pd.pivot_table(
#  df,values='cell_value',
#  index=['col1', 'col2', 'col3'], #these stay as columns; will fail silently if any of these cols have null values
#  columns=['col4']) #data values in this column become their own column

,1860,9583,3519,7688,8857,2295,4868,9008,583,8347,...,10784,10787,10790,10821,4944,10283,10349,5857,6037,3278
AccountNumber,5333,7871,7583,7249,7856,7815,2488,7818,4865,7153,...,5348,8310,3556,551,10540,7737,4613,4800,4031,7585
ParcelID,044-4-033-000,050-1-066-000,049-4-059-000,049-3-023-001,050-1-051-000,050-1-009-000,028-3-140-001,050-1-012-000,044-2-005-000,049-1-136-000,...,044-4-045-000,053-1-002-000,034-2-009-000,024-1-017-000,049-3-095-606,049-4-193-001,044-1-152-000,044-1-330-000,039-4-256-000,049-4-061-000
SpanNumber,114-035-15333,114-035-17871,114-035-17583,114-035-17249,114-035-17856,114-035-17815,114-035-12488,114-035-17818,114-035-14865,114-035-17153,...,114-035-15348,114-035-18310,114-035-13556,114-035-10551,114-035-20540,114-035-17737,114-035-14613,114-035-14800,114-035-14031,114-035-17585

Get Dummies
-------
This is used to change categorical information to multiple true false columns

In [41]:
foundation = pd.get_dummies(df['ZoningCode'], prefix = 'ZoningCode')
foundation.head(3)

,ZoningCode_BST,ZoningCode_D,ZoningCode_DT,ZoningCode_DW,ZoningCode_DWPT,ZoningCode_EAE,ZoningCode_ELM,ZoningCode_I,ZoningCode_NAC,ZoningCode_NACR,...,ZoningCode_RCOA,ZoningCode_RCOC,ZoningCode_RCOG,ZoningCode_RH,ZoningCode_RL,ZoningCode_RL-W,ZoningCode_RLW,ZoningCode_RM,ZoningCode_RMW,ZoningCode_UR
1860,0.000,1.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,...,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000
9583,0.000,0.000,0.000,0.000,0.000,0.000,0.000,1.000,0.000,0.000,...,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000
3519,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,...,0.000,0.000,0.000,0.000,0.000,0.000,0.000,1.000,0.000,0.000

Merging and Joining
-------

In [42]:
#Merge two different datasets
# dfmerged = pd.merge(set1,set2,on=proper)

In [43]:
setone = df[['AccountNumber','ParcelID','SpanNumber']]
settwo = df[['StreetNumber','AlternateNumber','StreetName','Unit','CuO1LastName','CuO1FirstName','CuO2LastName']]

# combine the two sets on the verticle axis
concatdf = pd.concat([setone, settwo], axis=1)
concatdf.head()

,AccountNumber,ParcelID,SpanNumber,StreetNumber,AlternateNumber,StreetName,Unit,CuO1LastName,CuO1FirstName,CuO2LastName
1860,5333,044-4-033-000,114-035-15333,75,3,CHERRY ST,NaN,"BTC MALL ASSOCIATES, LLC",NaN,NaN
9583,7871,050-1-066-000,114-035-17871,225,NaN,SOUTH WILLARD ST,NaN,CHAMPLAIN COLLEGE INC.,NaN,NaN
3519,7583,049-4-059-000,114-035-17583,230,NaN,ST PAUL ST,NaN,BURLINGTON HOUSING AUTHORITY,NaN,BHA DECKER TOWERS
7688,7249,049-3-023-001,114-035-17249,80,NaN,ST PAUL ST,NaN,BURLINGTON SAVINGS BANK,NaN,NaN
8857,7856,050-1-051-000,114-035-17856,227,NaN,SOUTH WILLARD ST,NaN,CHAMPLAIN COLLEGE INC.,NaN,NaN

Lower-Case Column Names
------------

In [44]:
# Lower-case everything in a DataFrame column
df.CuO1LastName = df.CuO1LastName.str.lower()
df.head(2)

,AccountNumber,ParcelID,SpanNumber,StreetNumber,AlternateNumber,StreetName,Unit,CuO1LastName,CuO1FirstName,CuO2LastName,...,GrantorName,NumofRooms,NumofBedrooms,BathsCombined,NumofUnits,ZoningCode,Foundation,Depreciation,PropertyCenterPoint,YearBltBin
1860,5333,044-4-033-000,114-035-15333,75,3,CHERRY ST,NaN,"btc mall associates, llc",NaN,NaN,...,NaN,605,605,0 / 0,605,D,C,1.000,"(-73.215, 44.47894)","(1950, 2015]"
9583,7871,050-1-066-000,114-035-17871,225,NaN,SOUTH WILLARD ST,NaN,champlain college inc.,NaN,NaN,...,NaN,400,0,11 / 0,20,I,BS,0.300,"(-73.2063, 44.47431)","(0, 1905]"

In [45]:
# Lower-case all DataFrame column names, this applies to the df unconditionally and may make troubleshooting hard if half way through
#df.columns = map(str.lower, df.columns)
df.head(1)

,AccountNumber,ParcelID,SpanNumber,StreetNumber,AlternateNumber,StreetName,Unit,CuO1LastName,CuO1FirstName,CuO2LastName,...,GrantorName,NumofRooms,NumofBedrooms,BathsCombined,NumofUnits,ZoningCode,Foundation,Depreciation,PropertyCenterPoint,YearBltBin
1860,5333,044-4-033-000,114-035-15333,75,3,CHERRY ST,NaN,"btc mall associates, llc",NaN,NaN,...,NaN,605,605,0 / 0,605,D,C,1.000,"(-73.215, 44.47894)","(1950, 2015]"

Slit Out Into Columns
---------------

In [46]:
# Split delimited values in a DataFrame column into two new columns
df['bath1'], df['bath2'] = zip(*df['BathsCombined'].apply(lambda x: x.split('/ ', 1)))
df.head(2)

,AccountNumber,ParcelID,SpanNumber,StreetNumber,AlternateNumber,StreetName,Unit,CuO1LastName,CuO1FirstName,CuO2LastName,...,NumofBedrooms,BathsCombined,NumofUnits,ZoningCode,Foundation,Depreciation,PropertyCenterPoint,YearBltBin,bath1,bath2
1860,5333,044-4-033-000,114-035-15333,75,3,CHERRY ST,NaN,"btc mall associates, llc",NaN,NaN,...,605,0 / 0,605,D,C,1.000,"(-73.215, 44.47894)","(1950, 2015]",0,0
9583,7871,050-1-066-000,114-035-17871,225,NaN,SOUTH WILLARD ST,NaN,champlain college inc.,NaN,NaN,...,0,11 / 0,20,I,BS,0.300,"(-73.2063, 44.47431)","(0, 1905]",11,0

Everything Below Is not yet ready for prime time
=================

In [47]:
# Full list of .str functions: http://pandas.pydata.org/pandas-docs/stable/text.html
# Slice values in a DataFrame column (aka Series)
#df.column.str[0:2]

In [48]:
# Select from DataFrame using multiple keys of a hierarchical index
#df.xs(('index level 1 value','index level 2 value'), level=('level 1','level 2'))

In [49]:
# Change all NaNs to None (useful before loading to a db)
#df = df.where((pd.notnull(df)), None)
df.head(3)

,AccountNumber,ParcelID,SpanNumber,StreetNumber,AlternateNumber,StreetName,Unit,CuO1LastName,CuO1FirstName,CuO2LastName,...,NumofBedrooms,BathsCombined,NumofUnits,ZoningCode,Foundation,Depreciation,PropertyCenterPoint,YearBltBin,bath1,bath2
1860,5333,044-4-033-000,114-035-15333,75,3,CHERRY ST,NaN,"btc mall associates, llc",NaN,NaN,...,605,0 / 0,605,D,C,1.000,"(-73.215, 44.47894)","(1950, 2015]",0,0
9583,7871,050-1-066-000,114-035-17871,225,NaN,SOUTH WILLARD ST,NaN,champlain college inc.,NaN,NaN,...,0,11 / 0,20,I,BS,0.300,"(-73.2063, 44.47431)","(0, 1905]",11,0
3519,7583,049-4-059-000,114-035-17583,230,NaN,ST PAUL ST,NaN,burlington housing authority,NaN,BHA DECKER TOWERS,...,106,161 / 1,161,RM,S,0.278,"(-73.213, 44.47275)","(1950, 2015]",161,1

In [50]:
# Concatenate two DataFrame columns into a new, single column
# (useful when dealing with composite keys, for example)
#df['newcol'] = df['col1'].map(str) + df['col2'].map(str)

In [51]:
# Doing calculations with DataFrame columns that have missing values
# In example below, swap in 0 for df['col1'] cells that contain null
#df['new_col'] = np.where(pd.isnull(df['col1']),0,df['col1']) + df['col2']

In [52]:
# Get rid of non-numeric values throughout a DataFrame:
for col in refunds.columns.values:
  refunds[col] = refunds[col].replace('[^0-9]+.-', '', regex=True)

NameError: name 'refunds' is not defined

In [ ]:
# Get a report of all duplicate records in a dataframe, based on specific columns
dupes = df[df.duplicated(['ZoningCode', 'Foundation'], keep=False)]